In [1]:
# conda install -c conda-forge ipython-sql
%load_ext sql

In [2]:
# %sql postgresql://student:student@127.0.0.1/sparkifydb
%sql postgresql://hynso:sigeMund67@127.0.0.1/sparkifydb

'Connected: hynso@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[(0, datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 83, 'free', None, None, 693, 'Lubbock, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 18, 3, 22, 4, 796000), 40, 'free', None, None, 555, 'Oxnard-Thousand Oaks-Ventura, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (4, datetime.datetime(2018, 11, 18, 9, 39, 4, 796000), 40, 'free', None, None, 698, 'Oxnard-Thousand Oaks-Ventura, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"'),
 (5, datetime.datetime(2018, 11, 18, 10, 18, 11, 796000), 79, 'free', None, None, 78, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)'),
 (9, datetime.datetime(2018, 11, 18, 13, 16, 1, 796000), 29, 'paid', None, None, 589, 'Atlanta-Sandy Springs-Roswell, GA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[(83, 'Stefany', 'White', 'F', 'free'),
 (40, 'Tucker', 'Garrison', 'M', 'free'),
 (40, 'Tucker', 'Garrison', 'M', 'free'),
 (79, 'James', 'Martin', 'M', 'free'),
 (29, 'Jacqueline', 'Lynch', 'F', 'paid')]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832'))]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN'))]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 2, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 3, 22, 4, 796000), 3, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 9, 39, 4, 796000), 9, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 10, 18, 11, 796000), 10, 18, 46, 11, 2018, 6),
 (datetime.datetime(2018, 11, 18, 13, 16, 1, 796000), 13, 18, 46, 11, 2018, 6)]

In [45]:
# song_select = (
#     """
#     SELECT 
#       song_id, 
#       artist_id
#     FROM songs
#     WHERE
#       title = '%s' AND
#       artist_id = '%s' AND
#       duration = '%s';
#     """
# )

# %sql SELECT                                 \
#        song_id,                             \
#        artist_id,                           \
#        duration                             \
#      FROM songs                             \
#      WHERE                                  \
#        title = 'Pink World' AND             \
#        artist_id = 'AR8ZCNI1187B9A069B' AND \
#        duration = '269.81832';

# %sql \
#   SELECT \
#     song_id, \
#     artist_id, \
#     duration \
#   FROM songs \
#   WHERE \
#     title = ('Pink World') AND \
#     artist_id = ('AR8ZCNI1187B9A069B') AND \
#     duration = (269.81832);

 * postgresql://hynso:***@127.0.0.1/sparkifydb
3 rows affected.

[('SOIAZJW12AB01853F1', 'AR8ZCNI1187B9A069B', Decimal('269.81832')),
 ('SOIAZJW12AB01853F1', 'AR8ZCNI1187B9A069B', Decimal('269.81832')),
 ('SOIAZJW12AB01853F1', 'AR8ZCNI1187B9A069B', Decimal('269.81832'))]

In [3]:
%sql select song_id, COUNT(*) from songplays GROUP BY song_id;

 * postgresql://hynso:***@127.0.0.1/sparkifydb
0 rows affected.

[]